arch/index.org
#+TITLE: Architettura degli elaboratori
#+AUTHOR: Jacopo Costantini

* Cose da fare
** DONE introduzione
** DONE numbers
** DONE esempi numbers
** TODO algebra di bool
** TODO esempi algebra di bool
** TODO circuiti
** TODO ISA-MIMPS
** TODO ALU
** TODO mult
** TODO memorie e circuiti sequenziali
** TODO sintesi circuiti sequenziali
** TODO esercizi circuiti sequenziali
** TODO Progetto CPU (ciclo singolo)
** TODO Progetto CPU (multiciclo)
** TODO Valutazione delle prestazioni
** TODO Esercizi sulla valutazione delle prestazioni


* Indice degli argomenti
** [[file:introduzione.org][Introduzione]]
** [[file:numbers.org][Rappresentazione dell'informazione]]
** [[file:bool.org][Algebra di Bool]]
