docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-29 Wed 10:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Architettura degli elaboratori</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jacopo Costantini" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Architettura degli elaboratori</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga568cbf">1. Cose da fare</a>
<ul>
<li><a href="#orgc2224ce">1.1. <span class="done DONE">DONE</span> introduzione</a></li>
<li><a href="#org256ef92">1.2. <span class="done DONE">DONE</span> numbers</a></li>
<li><a href="#orgf55d4d8">1.3. <span class="todo TODO">TODO</span> esempi numbers</a></li>
<li><a href="#orgf35e84a">1.4. <span class="todo TODO">TODO</span> algebra di bool</a></li>
<li><a href="#org8bbe206">1.5. <span class="todo TODO">TODO</span> esempi algebra di bool</a></li>
<li><a href="#orgae8d9a6">1.6. <span class="todo TODO">TODO</span> circuiti</a></li>
<li><a href="#orgefdbe1d">1.7. <span class="todo TODO">TODO</span> ISA-MIMPS</a></li>
<li><a href="#org0f0c0ff">1.8. <span class="todo TODO">TODO</span> ALU</a></li>
<li><a href="#orgc7c0633">1.9. <span class="todo TODO">TODO</span> mult</a></li>
<li><a href="#orgbf2e4e0">1.10. <span class="todo TODO">TODO</span> memorie e circuiti sequenziali</a></li>
<li><a href="#org9ca977c">1.11. <span class="todo TODO">TODO</span> sintesi circuiti sequenziali</a></li>
<li><a href="#org95e169d">1.12. <span class="todo TODO">TODO</span> esercizi circuiti sequenziali</a></li>
<li><a href="#orgafaf51c">1.13. <span class="todo TODO">TODO</span> Progetto CPU (ciclo singolo)</a></li>
<li><a href="#org680eaf4">1.14. <span class="todo TODO">TODO</span> Progetto CPU (multiciclo)</a></li>
<li><a href="#org3649ad9">1.15. <span class="todo TODO">TODO</span> Valutazione delle prestazioni</a></li>
<li><a href="#org27ff52d">1.16. <span class="todo TODO">TODO</span> Esercizi sulla valutazione delle prestazioni</a></li>
</ul>
</li>
<li><a href="#orga152485">2. Indice degli argomenti</a>
<ul>
<li><a href="#org156d891">2.1. Introduzione</a></li>
<li><a href="#org5a57e97">2.2. Rappresentazione dell'informazione</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga568cbf" class="outline-2">
<h2 id="orga568cbf"><span class="section-number-2">1</span> Cose da fare</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc2224ce" class="outline-3">
<h3 id="orgc2224ce"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> introduzione</h3>
<div class="outline-text-3" id="text-1-1">
</div>
</div>
<div id="outline-container-org256ef92" class="outline-3">
<h3 id="org256ef92"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> numbers</h3>
</div>
<div id="outline-container-orgf55d4d8" class="outline-3">
<h3 id="orgf55d4d8"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> esempi numbers</h3>
</div>
<div id="outline-container-orgf35e84a" class="outline-3">
<h3 id="orgf35e84a"><span class="section-number-3">1.4</span> <span class="todo TODO">TODO</span> algebra di bool</h3>
</div>
<div id="outline-container-org8bbe206" class="outline-3">
<h3 id="org8bbe206"><span class="section-number-3">1.5</span> <span class="todo TODO">TODO</span> esempi algebra di bool</h3>
</div>
<div id="outline-container-orgae8d9a6" class="outline-3">
<h3 id="orgae8d9a6"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> circuiti</h3>
</div>
<div id="outline-container-orgefdbe1d" class="outline-3">
<h3 id="orgefdbe1d"><span class="section-number-3">1.7</span> <span class="todo TODO">TODO</span> ISA-MIMPS</h3>
</div>
<div id="outline-container-org0f0c0ff" class="outline-3">
<h3 id="org0f0c0ff"><span class="section-number-3">1.8</span> <span class="todo TODO">TODO</span> ALU</h3>
</div>
<div id="outline-container-orgc7c0633" class="outline-3">
<h3 id="orgc7c0633"><span class="section-number-3">1.9</span> <span class="todo TODO">TODO</span> mult</h3>
</div>
<div id="outline-container-orgbf2e4e0" class="outline-3">
<h3 id="orgbf2e4e0"><span class="section-number-3">1.10</span> <span class="todo TODO">TODO</span> memorie e circuiti sequenziali</h3>
</div>
<div id="outline-container-org9ca977c" class="outline-3">
<h3 id="org9ca977c"><span class="section-number-3">1.11</span> <span class="todo TODO">TODO</span> sintesi circuiti sequenziali</h3>
</div>
<div id="outline-container-org95e169d" class="outline-3">
<h3 id="org95e169d"><span class="section-number-3">1.12</span> <span class="todo TODO">TODO</span> esercizi circuiti sequenziali</h3>
</div>
<div id="outline-container-orgafaf51c" class="outline-3">
<h3 id="orgafaf51c"><span class="section-number-3">1.13</span> <span class="todo TODO">TODO</span> Progetto CPU (ciclo singolo)</h3>
</div>
<div id="outline-container-org680eaf4" class="outline-3">
<h3 id="org680eaf4"><span class="section-number-3">1.14</span> <span class="todo TODO">TODO</span> Progetto CPU (multiciclo)</h3>
</div>
<div id="outline-container-org3649ad9" class="outline-3">
<h3 id="org3649ad9"><span class="section-number-3">1.15</span> <span class="todo TODO">TODO</span> Valutazione delle prestazioni</h3>
</div>
<div id="outline-container-org27ff52d" class="outline-3">
<h3 id="org27ff52d"><span class="section-number-3">1.16</span> <span class="todo TODO">TODO</span> Esercizi sulla valutazione delle prestazioni</h3>
</div>
</div>


<div id="outline-container-orga152485" class="outline-2">
<h2 id="orga152485"><span class="section-number-2">2</span> Indice degli argomenti</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org156d891" class="outline-3">
<h3 id="org156d891"><span class="section-number-3">2.1</span> <a href="introduzione.html">Introduzione</a></h3>
</div>
<div id="outline-container-org5a57e97" class="outline-3">
<h3 id="org5a57e97"><span class="section-number-3">2.2</span> <a href="numbers.html">Rappresentazione dell'informazione</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jacopo Costantini</p>
<p class="date">Created: 2021-12-29 Wed 10:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
